Tekla.Structures.DialogInternal.DialogDataStorage.#ctor
Creates a data storage with an empty name.

Tekla.Structures.DialogInternal.DialogDataStorage.#ctor(System.String)
Creates a named data storage.
name: The name of the data storage.